{
  "rss": {
    "-xmlns:dc": "http://purl.org/dc/elements/1.1/",
    "-xmlns:atom": "http://www.w3.org/2005/Atom",
    "-xmlns:media": "http://search.yahoo.com/mrss/",
    "-version": "2.0",
    "channel": {
      "title": "Featured Atlanta restaurants",
      "link": "http://www.accessatlanta.com/list/entertainment/restaurants/featured-atlanta-restaurants/aMT5/",
      "atom:link": {
        "-href": "http://www.accessatlanta.com/list/rss-mobile/entertainment/restaurants/featured-atlanta-restaurants/aMT5/",
        "-rel": "self"
      },
      "language": "en-us",
      "lastBuildDate": "Tue, 24 Feb 2015 11:21:48 -0500",
      "item": [
        {
          "title": "First Look: Superica, Krog Street Market",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-superica-krog-street-market/nkHnh/",
          "description": "<p>Just named a 2015 James Beard Awards Outstanding Restaurateur semifinalist, Ford Fry (JCT. Kitchen, No. 246, The Optimist, King + Duke, St. Cecilia) recently added Superica to his Rocket Farm Restaurants group roster.</p>
<p>The &ldquo;Mex-Tex&rdquo; concept shares a similar menu and design with the El Felix, which Fry opened in Alpharetta&rsquo;s Avalon development in late 2014. But the happening Krog Street Market location exudes a different kind of energy.</p>
<p><strong>The look:</strong> From the lighted marquee letter sign in front to an expansive bar area and a dining room with a mezzanine that doubles as a live music stage, the design promises a Texas kind of good time. The front patio and private party room offer even more entertainment possibilities.</p>
<p><strong>The scene:</strong> Last Friday, an enthusiastic dinnertime throng swarmed the bar and quickly swelled to the edges of the dining room. Fry was on hand, along with chef Kevin Maxey, as busy servers kept orders rolling from the semi-open kitchen to the sounds of Billy Joe Shaver and Roky Erickson.</p>
<p><strong>The food:</strong> Fry and Maxey put together a menu that runs true to their hot and spicy Texas roots. Starters and small plates ($6-$12) include hot tamales, tacos al pastor, and three variations on chili con queso. Chicken and vegetable tortilla soup ($5/$9) is flavored with ancho chili, cilantro, avocado and Jack cheese. Plates with rice and beans ($12-$16) range from San Antonio-style &ldquo;puffy tacos&rdquo; to chili rellenos and five kinds of enchiladas. Larger plates ($16-$34) include mesquite-grilled quail with pork tamales and a slow-braised short rib grilled with chipotle molasses.</p>
<p><strong>The drinks:</strong> On the cocktail list, find eight different margaritas ($8-$12), including the signature Superita with Herradura Double Reposado, Royal Combier, lime juice, orange juice, salt and citrus-marinated olives. The Red Headed Stranger mixes Deep Eddy Ruby Red vodka, Campari, grapefruit juice and lime. Negro Modelo and New Holland Sun Dog Amber are on the current draft beer list ($4-$5).</p>
<p><strong>The extras:</strong> Weekday $10.99 lunch specials are served with rice and beans and feature a choice of two items from a list that includes nachos, tacos, enchiladas, soup and a house salad. Look for weekend breakfast soon and live music late Thursday-Saturday.</p>
<hr />
<p>DINING OUT</p>
<p>Lunch: 11 a.m.-2:30 p.m. Monday-Friday. Dinner: 5-10 p.m. Monday-Thursday; 5-11 p.m. Friday; 11 a.m.-11 p.m. Saturday; 11 a.m.-10 p.m. Sunday. Bar open late Thursday-Saturday.</p>
<p>Starters and small plates, $6-$12; soups and salads, $5-$15; plates, $12-$16; entrees, $17-$34; lunch specials, $10.99.</p>
<p>99 Krog St. NE, Atlanta. 678-791-1310, <a href=\"http://www.supericaatl.com\" target=\"_blank\">supericaatl.com</a>.</p>",
          "pubDate": "Tue, 24 Feb 2015 11:21:48 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2815654/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/24/0d/54/Superica-Erik-Meadows-Photography-red-headed-stranger-cocktail.jpg",
            "-length": "1631565",
            "-type": "image/jpeg"
          },
          "category": [
            "things to do",
            "taxon:fooddrink",
            "restaurants",
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/24/0d/54/Superica-Erik-Meadows-Photography-red-headed-stranger-cocktail.jpg",
            "media:description": "The Red Headed Stranger mixes Deep Eddy Ruby Red vodka, Campari, grapefruit juice and lime. Credit: Erik Meadows"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Made Kitchen & Cocktails, Alpharetta",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-made-kitchen-cocktails-alpharetta/nkCQx/",
          "description": "<p>Recently opened on Roswell Street in Alpharetta, Made Kitchen &amp; Cocktails is the latest restaurant venture from Chris Sedgwick of Bistro VG, Vinny&rsquo;s and Pure Taqueria. The menu features Spanish-style dishes from executive chef Tim Agee, and a bar program that mixes seasonal cocktails and Spanish wines.</p>
<p><strong>The look:</strong> Just up the street from the original Pure location, Made shares a freestanding building with a dental group. The rustic-modern build-out employs wood in various forms, from beams and tabletops to champagne riddling racks re-purposed as window shutters. With its wood-fired grill and marble pass, the open kitchen functions as a kind of hearth.</p>
<p><strong>The scene:</strong> At lunch one cold and sunny Friday afternoon, the lone bartender stayed surprisingly busy pouring wine and making cocktails. Around the dining room, several couples seemed to be getting a head start on Valentine&rsquo;s Day, while at least one group of women were already celebrating the weekend.</p>
<p><strong>The food:</strong> Topping Agee&rsquo;s offerings, mix-and-match cheese and charcuterie ($6-$15) are served with accompaniments and bread. But a sizable selection of tapas is the heart of the menu. Look for the likes of a half-dozen wood-grilled oysters ($12) with smoked paprika and chorizo butter, octopus ($11) with pickled peppers and olives, and plancha-grilled prawns ($15) with lemon butter. Entrees include whole grilled branzino with shishito peppers ($25), a bone-in pork chop with maitake mushrooms ($23), and mixed seafood paella for two ($42).</p>
<p><strong>The drinks:</strong> On the current cocktail list, Young Man&rsquo;s Song ($10) is Strega, rhubarb bitters, fresh lemon and egg white, while Ain&rsquo;t No Sunshine ($13) blends Buffalo Trace bourbon, Cardamaro, Dolin Rouge and walnut bitters. The single beer on draft is Estrella Damm ($4/$6), a pale lager brewed in Barcelona.</p>
<p><strong>The extras:</strong> On weekdays, the lunch menu includes a couple of salads ($11-$12) and Spanish-style sandwiches ($12-$13) served with a choice of fried potatoes, a side salad or stewed lentils. For dessert, there&rsquo;s espresso creme Catalan ($7) and a seasonal tapas tart ($4) with vanilla mascarpone ice cream.</p>
<hr />
<p>DINING OUT</p>
<p>11 a.m.-11 p.m. Monday-Friday; 5-11 p.m. Saturday-Sunday.</p>
<p>Cheese and charcuterie, $6-$15; tapas, $5-$15; salads, $7-$9; entrees, $20-$42; lunch, $11-$19; desserts, $4-$7.</p>
<p>45 B Roswell St., Alpharetta. 770-452-6233, <a href=\"http://www.madekc.com\" target=\"_blank\">madekc.com</a>.</p>",
          "pubDate": "Tue, 17 Feb 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2806030/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/16/98/0c/021815firstlook-3.jpg",
            "-length": "427986",
            "-type": "image/jpeg"
          },
          "category": [
            "taxon:restaurants",
            "new restaurants",
            "lifestyle",
            "food",
            "ajc-features",
            "roswell",
            "North Fulton County"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/16/98/0c/021815firstlook-3.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "Made Kitchen & Cocktails’ grilled octopus with pickled peppers and olives, plancha-grilled prawns with lemon butter, and Young Man’s Song cocktail. (Beckysteinphotography.com)"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "Colletta open at Avalon, Alpharetta",
          "link": "http://www.accessatlanta.com/news/entertainment/restaurants/whats-new/nkJPW/",
          "description": "<p><strong></strong>Colletta Italian restaurant opened on Feb. 5 at Avalon in Alpharetta. The sister restaurant to Oak Steakhouse is the newest concept from Charleston-based the Indigo Road group. With an open kitchen helmed by chef Michael Perez, the menu features antipasti, pizza, pasta, and wood-fired entrees, plus four-course family style dining. From the bar, look for classic Italian cocktails, Italian wines, Italian and local beers, and prosecco on tap. 900 Third Street, Alpharetta. 678-722-8335, <a href=\"http://www.collettarestaurant.com\" target=\"_blank\">collettarestaurant.com</a>.</p>
<p><strong>RELATED</strong></p>
<h3><a href=\"http://atlantarestaurants.blog.ajc.com/2014/10/28/avalon-in-alpharetta-restaurants-food-shopping-and-more/\">Avalon in Alpharetta: Restaurants, food shopping and&nbsp;more</a> (blog post)<a href=\"http://atlantarestaurants.blog.ajc.com/2014/10/28/avalon-in-alpharetta-restaurants-food-shopping-and-more/\"><strong></strong></a></h3>",
          "pubDate": "Thu, 12 Feb 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2817008/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/05/72/7f/tmpuFHI5a-mdly-photo.jpg",
            "-length": "69009",
            "-type": "image/jpeg"
          },
          "category": [
            "taxon:restaurants",
            "restaurants",
            "new restaurants",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/05/72/7f/tmpuFHI5a-mdly-photo.jpg",
            "media:description": " "
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Twin Smokers BBQ, Downtown",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-twin-smokers-bbq-downtown/nj7jc/",
          "description": "<p>After some delays, Twin Smokers, the latest concept from Legacy Restaurant Partners, opened in downtown Atlanta&rsquo;s Luckie Marietta District in late December. The space features a pair of custom fire engine red Oyler 700 smokers, nicknamed Elizabeth and Matthew, with one designated for chicken and pork, and the other for beef.</p>
<p><strong>The look:</strong> The surprisingly cozy rustic design features a central bar area with views of the smokers. One wall of the dining room displays the &ldquo;wood library,&rdquo; neatly stacked with mesquite, oak and hickory logs used to smoke and flavor the meats.</p>
<p><strong>The scene:</strong> One recent weeknight, Marietta Street was jammed with Hawks game traffic. Inside, the majority of diners were seated at the bar, watching basketball and drinking beer, with a few couples and some larger parties scattered at booths and tables.</p>
<p><strong>The food:</strong> Like Elizabeth and Matthew, the menu is divided between oak- and hickory-smoked Southern-style pulled pork, pork ribs and chicken, and oak- and mesquite-smoked Texas-style brisket, beef ribs and local Patak sausage. Sandwiches ($8-$11) are served with one side, while plates and combos ($10-$26) are served with two sides. The family-style &ldquo;Pride and Joy&rdquo; ($75) serves four to six with a pound of pulled pork and a pound of brisket, two sausage links, a full rack of pork ribs, three pint-size sides, bread and pickles.</p>
<p><strong>The drinks:</strong> Whiskey and craft beer are the stars of the beverage menu with plenty of top shelf Kentucky straight bourbons and a good selection of small batch whiskey, rye and moonshine. The recent local draft beer list included Monday Night Drafty Kilt ($7) and Red Hare Common ($6). The Twin Smokers Bar Cocktail ($7) is a mix of Evan Williams Reserve bourbon, fresh grapefruit juice and basil. The potent Double Trouble milkshake ($12) blends High Road vanilla ice cream and Bulleit bourbon.</p>
<p><strong>The extras</strong>: Meats and sides are available for carry-out, or you can call to schedule drop-off or full-service catering. Three-hour validated parking at the Hilton Garden Inn deck directly across the street is free with a minimum purchase of $10 weekdays and $20 weekends.</p>
<hr />
<p>DINING OUT</p>
<p>11:30 a.m.-9 p.m. Monday-Sunday, or until the barbecue runs out.</p>
<p>Sandwiches, $8-$11; plates and combos, $10-$26; sides and add-ons, $4-$12; desserts and milkshakes, $3-$12.</p>
<p>300 Marietta St., Atlanta. 404-698-4707, <a href=\"http://twinsmokersbbq.com\" target=\"_blank\">twinsmokersbbq.com</a>.</p>",
          "pubDate": "Tue, 10 Feb 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2797837/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/09/93/3d/021115-first-look_.jpg",
            "-length": "262514",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/09/93/3d/021115-first-look_.jpg",
            "media:description": "Pulled pork sandwich at Twin Smokers. Contributed by Twin Smokers BBQ."
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Buckhead Tavern, Buckhead",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-buckhead-tavern-buckhead/nj3Pw/",
          "description": "<p>In mid-December, Buckhead Tavern opened in the former Bonehead&rsquo;s space at the Eclipse Buckhead Condominium development. Johnny Esposito Jr., son of Johnny&rsquo;s Hideaway founder Johnny Esposito Sr. partnered with Atlanta restaurateur Ron Barber on the neighborhood sports bar and live entertainment concept.</p>
<p><strong>The look:</strong> Located at the corner of Pharr Road and North Fulton Drive, down the block from the new Buckhead Atlanta development, the build-out conjures elements of old Buckhead Village. A spacious U-shaped bar surrounded by suspended TVs anchors the center of the main dining room, where dark wood, cushy booths and communal tables come together in a refined casual style.</p>
<p><strong>The scene:</strong> Depending on the time of day, the atmosphere can change dramatically. One recent Saturday afternoon, there was a surprisingly quiet mix of couples and families having lunch, and guys settled in at the bar, drinking beer and watching basketball. But happy hour and late night bring out the Buckhead party crowds.</p>
<p><strong>The food:</strong> Executive chef Nicole Christner&rsquo;s menu offers takes on traditional tavern fare with hearty entrees and some healthy choices made with locally sourced ingredients. Beef sliders ($11) are stacked with bourbon bacon jam, cheddar and special Tavern Sauce on Holeman &amp; Finch buns. The Buddha Bowl ($13) is a mix of Georgia greens, green beans, avocado, chick peas, carrots, tomatoes, edamame, broccoli and ginger soy vinaigrette. A thick-cut heritage pork chop ($22) is served with smashed potatoes, broccolini and rosemary apple jus.</p>
<p><strong>The drinks:</strong> On the beverage menu, find classic cocktails, such as the Buffalo Trace Manhattan ($13), along with house creations, such as the Big Dog Daddy ($13) with Wild Shot reposado mezcal, rye and blackberry brandy. The recent draft beer list featured Sweetwater 420 ($5.50) and Goose Island IPA ($5).</p>
<p><strong>The extras:</strong> Look for live entertainment Thursdays through Sundays. At the back of the restaurant, there&rsquo;s another full service bar with TVs and additional seating for private parties and sports events.</p>
<hr />
<p>DINING OUT</p>
<p>11:30 a.m.-midnight Monday-Thursday; 11:30 a.m.-2 a.m. Friday-Saturday; 11:30 a.m.-11 p.m. Sunday.</p>
<p>Appetizers, $4-$12; salads, $5-$15; sandwiches and burgers, $11-$15; entrees, $17-$24; sides, $4.50-$6.</p>
<p>264 Pharr Road, Atlanta. 404-917-2620, <a href=\"http://thebuckheadtavern.com\" target=\"_blank\">thebuckheadtavern.com</a>.</p>",
          "pubDate": "Tue, 03 Feb 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2788310/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/02/1d/08/020415-first-look_1.jpg",
            "-length": "161026",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features",
            "Buckhead"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/02/02/1d/08/020415-first-look_1.jpg",
            "media:description": "The Buddha Bowl at Buckhead Tavern. Credit: Heidi Geldhauser"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Tutto Kitchen & Bar, Roswell",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-tutto-kitchen-bar-roswell/njxdc/",
          "description": "<p>From the team behind Peachtree Diner and the Diner at North Point, Tutto Kitchen &amp; Bar opened in downtown Roswell in mid-November. The Italian-American concept took over a pair of quaint storefront spaces at the cusp of Alpharetta Street and Elizabeth Way.</p>
<p><strong>The look:</strong> The L-shaped build-out features a spacious bar area on the Elizabeth Way side, and an intimate dining room facing Alpharetta Street. In total, the decor and ambiance come off as a swanky version of an old-school red sauce joint, with a bit of a clubby South Beach vibe &mdash; especially in the neon-blue running under the bar rail.</p>
<p><strong>The scene:</strong> One recent afternoon, the crowd in the dining room was skewed toward ladies who lunch, and many seemed content sipping wine and picking at salads. Meanwhile, at the bar, an exuberant bartender offered guests samples of several craft beers on draft.</p>
<p><strong>The food:</strong> The sprawling menu opens with a collection of small plates and appetizers, such as beef tenderloin carpaccio ($11), grilled octopus ($10) and veal meatballs ($9). Pasta dishes include rigatoni with short rib ragu ($17) and seafood Fra Diavolo ($24) with shrimp, scallops, clams and calamari. Entrees range from seared diver scallops with white truffle risotto ($24) to braised Colorado lamb shank with creamy polenta ($23).</p>
<p><strong>The drinks:</strong> The full bar offers signature and classic cocktails, such as the No. 3 Negroni ($8), and some 70 wines by the glass and bottle ($7-$120). On the recent beer list, local drafts ($6) included Strawn IPA and Wild Heaven Ode To Mercy.</p>
<p><strong>The extras:</strong> At lunch, served 11 a.m.-4 p.m. daily, look for sandwiches, soups and salads, and a $10 specials menu with the likes of a house burger and fries and grilled shrimp and polenta.</p>
<p><strong> <a href=\"http://www.myajc.com/list/entertainment/dining/restaurant-first-looks/aFgg/\">More of our First Looks at local restaurants</a></strong></p>
<hr />
<p>DINING OUT</p>
<p>11a.m.-10 p.m. Monday-Thursday; 11 a.m.-10 p.m. Friday-Saturday; noon-9 p.m. Sunday. Lunch menu: 11 a.m.-4 p.m. daily.</p>
<p>Appetizers and small plates, $7-$11; soups and salads, $5-$7; pasta and risotto, $14-$24; entrees, $18-$26; sides, $4-$6; desserts, $3.50-$6.</p>
<p>942 Alpharetta St., Roswell. 678-878-2525, <a href=\"http://tuttokitchenandbar.com\" target=\"_blank\">tuttokitchenandbar.com</a>.</p>",
          "pubDate": "Tue, 27 Jan 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2779977/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/26/3d/44/012815-first-look_Seafood-Fra-Diavolo.jpg",
            "-length": "298577",
            "-type": "image/jpeg"
          },
          "category": [
            "roswell",
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/26/3d/44/012815-first-look_Seafood-Fra-Diavolo.jpg",
            "media:description": "Seafood Fra Diavolo at Tutto Kitchen & Bar in Roswell. Contributed by M-Squared Public Relations"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "Service lags behind food at French newcomer",
          "link": "http://www.myajc.com/news/entertainment/restaurants/service-lags-behind-food-at-french-newcomer/njntL/",
          "description": "<p>People over the age of, say, 45 will recognize Le Bilboquet for what it is. Not just a French restaurant, but a certain kind of French restaurant that was popular about 20 years ago &mdash; one that imbued classic brasserie style with uptown fanciness. Take in the sights at this Buckhead Atlanta newcomer &mdash; the zinc bar, the gleaming porcelain dishes, the natty waiters, the scrolling font of the menu &mdash; and you know where you are.</p>
<p>This kitchen mostly does right by its classics. If you&rsquo;re hankering for a worthwhile steak tartare, moules frites or fat profiteroles with vanilla ice cream and bitter chocolate sauce, you will be happy to taste the finessed renditions Le Bilboquet is capable of.</p>
<p>The food is almost good enough to make you accept the elevated prices here, where a meal can easily top out at $100 a head. Alas, the well meaning but clumsy service staff isn&rsquo;t yet up to the task, and I can&rsquo;t in good conscience recommend a restaurant that&rsquo;s this expensive without a caveat.</p>
<hr />
<p><strong>LE BILBOQUET</strong></p>
<p>3035 Peachtree Road, Atlanta. 404-869-9944, <a href=\"http://lebilboquetatlanta.com\" target=\"_blank\">lebilboquetatlanta.com</a>. $$$-$$$$</p>
<p>1 of 4 stars [good]</p>",
          "pubDate": "Sat, 24 Jan 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2765065/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/14/94/18/011615Kessler-8.jpg",
            "-length": "356142",
            "-type": "image/jpeg"
          },
          "category": [
            "restaurant reviews",
            "ajc-features",
            "FoodDrink"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/14/94/18/011615Kessler-8.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "Cajun chicken with French fries and salad is one of the menu offerings at Le Bilboquet in Buckhead. (Becky Stein / beckysteinphotography.com)"
          },
          "dc:creator": "John Kessler"
        },
        {
          "title": "First Look: The Cockentrice, Krog Street Market",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-the-cockentrice-krog-street-market/njqNZ/",
          "description": "<p>The chimerical Medieval cockentrice combines a capon and a suckling pig into a single culinary creation. The Cockentrice is also the name of the first restaurant from Kevin Ouzts, best known as the chef behind the boutique charcuterie, the Spotted Trotter. It&rsquo;s been open since early January.</p>
<p><strong>The look:</strong> One of the full-service anchors at Krog Street Market, the Cockentrice is a place defined by the celebration of butchery and charcuterie, from glass cases near the front entrance to displays of cured meats hanging around the dining room. Sturdy wood and metal tables and chairs, upholstered banquettes, and the tidy tiles and stainless steel surrounding the open kitchen give the space the stately feeling of an updated chophouse.</p>
<p><strong>The scene:</strong> Early one Saturday night, roving bands of eaters and drinkers swarmed through the Market&rsquo;s food hall. Inside the restaurant, the mood was strikingly more serene. But the bar was buzzing, and there was already a wait for a table.</p>
<p><strong>The food:</strong> Ouzts&rsquo; cooking is aimed at pushing the boundaries of preparing and pairing meat, while acknowledging his debts to the past. Not surprisingly, a large portion of the menu is dedicated to contemporary charcuterie ($6-$18), including the likes of black pepper sorghum salami, heirloom prosciutto, and duck fat and foie gras pate. Larger offerings range from Burgundy-braised beef pillows with Jerusalem artichokes, morel mushrooms and mirepoix ($18) and roasted red fish in caul fat with celeriac, Swiss chard, potato and roasted duck jus ($24), to confit of suckling pig ($22).</p>
<p><strong>The drinks:</strong> Ouzts&rsquo; sister, Daisy Nagel, who is in charge of both the front of the house and the beverage program, has curated a wine list with a good number of reasonably priced selections by the glass ($8-$13). Behind the bar, Tyler Austin features house cocktails such as the Farringdon with gin, Dolin Blanc, Vida mezcal rinse, and smoked paprika oil ($12), and the Pret a Mangiare with bourbon, maple syrup, a whole egg, and Spotted Trotter trimmings ($12).</p>
<p><strong>The extras:</strong> If you&rsquo;re in the mood for more meat, the shop in front stocks charcuterie, fresh sausages and hefty dry-aged steaks.</p>
<hr />
<p>DINING OUT</p>
<p>5:30-11 p.m. Sundays and Tuesday-Thursday; 5:30 p.m.-midnight Friday-Saturday. Closed Mondays.</p>
<p>Charcuterie, cheese and accompaniments, $6-$18; larger plates and entrees, $17-$31.</p>
<p>99 Krog St., Suite V, Atlanta. 470-428-2509, <a href=\"http://thespottedtrotter.com/cockentrice-now-open\" target=\"_blank\">thespottedtrotter.com/cockentrice-now-open</a>.</p>
<p>.</p>",
          "pubDate": "Tue, 20 Jan 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2768366/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/16/dc/82/012115firstlook-2.jpg",
            "-length": "263049",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features",
            "Intown Atlanta"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/16/dc/82/012115firstlook-2.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "The Cockentrice Burgundy-braised beef pillows with Jerusalem artichokes, mushrooms and mirepoix. (Beckysteinphotography.com)"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Grain, Midtown",
          "link": "http://www.accessatlanta.com/news/entertainment/restaurants/first-look-grain-midtown/njm3M/",
          "description": "<p>Grain, a new cocktail-centered spot from the owners of Cypress Street Pint and Plate and Seven Lamps, opened last month at MidCity Lofts in Midtown. Seven Lamps chef Drew Van Leuvan and barman Kevin Bragg are behind the food and drink at the tiny storefront space, that somehow manages to be urban and sophisticated and warm and communal at the same time.</p>
<p><strong>The look:</strong> Floor-to-ceiling windows create transparent views of the sidewalk patio and West Peachtree Street tableau. But the focal point of the design is a long concrete slab bar, with a row of wood plank appendages offering intimate seating for small parties. Believe it or not, that closet-like opening at the end of the back bar is the kitchen.</p>
<p><strong>The scene:</strong> One recent evening, both Van Leuvan and Bragg were on hand, along with Bill Streck of Cypress Street, who was minding the front of the house. Magically, the lively crowd ebbed and flowed, but everyone quickly found a seat somewhere.</p>
<p><strong>The food:</strong> Van Leuvan&rsquo;s bar snacks and small plates menu is a sort of sensory study of the raw, cooked and molecular. Market-priced East Coast and West Coast oysters on the half shell and hamachi sashimi ($12) meet hanger steak tartare and house-made charcuterie ($7-$25). Sly snacks include &ldquo;nitro-salted&rdquo; caramel corn ($4) served smoking in a paper cone, and delicately plated but powerful edible cocktails ($5) such as mezcal-flavored Asian pears. For bigger bites, find the likes of broiled branzino ($18) and lobster mac and cheese ($16).</p>
<p><strong>The drinks:</strong> Bragg&rsquo;s beverage menu includes craft beer and cocktails on draft. Among recent specialties, the Blooming Hill ($9), with gin, lemongrass, ginger, lime and basil, and the Not So Neutral ($13) with bourbon, Punt e Mess, Benedictine and grapefruit bitters. There&rsquo;s also a concise wine list, with a dozen offerings by the glass ($9-$14).</p>
<p><strong>The extras:</strong> Check out oyster happy hour, 3-6 p.m Mondays-Fridays. For sweet tooths, Van Leuvan concocts treats such as milk chocolate mousse with passion fruit caramel.</p>
<hr />
<p><strong>DINING OUT</strong></p>
<p>3 p.m.-3 a.m. Monday-Saturday; 3 p.m.-midnight Sunday.</p>
<p>Bar snacks and small plates, $4-$25;</p>
<p>856 W. Peachtree St., Atlanta. 404-881-5377, <a href=\"http://grain-bar.com/\" target=\"_blank\">grain-bar.com</a>.</p>",
          "pubDate": "Tue, 13 Jan 2015 10:12:58 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2763139/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/13/89/47/011415-first-look_1.jpg",
            "-length": "588752",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features",
            "Intown Atlanta"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/13/89/47/011415-first-look_1.jpg",
            "media:description": "Grain features a daily variety of fresh oysters and hosts oyster happy hour 3-6 p.m Mondays-Fridays. Photo Credit: Tomas Espinoza."
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "The El Felix, Alpharetta",
          "link": "http://www.ajc.com/news/entertainment/restaurants/el-felix-alpharetta/njpNj/",
          "description": "<h3>El Felix adds to successful lineup from Ford Fry</h3>
<p>&nbsp; &nbsp;&nbsp; The El Felix, in Alpharetta&rsquo;s new Avalon complex, is the latest from successful Atlanta restaurateur (and native Texan) Ford Fry. &nbsp;&nbsp; Though it&rsquo;s by far his most casual restaurant, it feels like the most heartfelt. The best cooking here happens inside that Venn diagram subset where chef-crafted integrity and sense of place intersect. &nbsp;&nbsp; You can admire the tender bite of a tamale or the spice-speckled rumble of crisp skin along a fat, juicy slice of chicken fajita. You also feel in your heart that the mounds of iceberg lettuce and shreds of yellow cheese flanking an order of finger-blistering puffy tacos provide the right touch. &nbsp;&nbsp; What you&rsquo;re tasting is the native-son affection with which Ford and executive chef Kevin Maxey, also a Texan, created this food. I think they may be a bit too chefy at times and perhaps a bit beholden to tradition at other times, but they go at this menu with smarts and soul.</p>
<p><strong>THE EL FELIX</strong><br />1130 Avalon Boulevard, Alpharetta. 678-248-5239, <a href=\"http://theelfelix.com\">theelfelix.com</a><br />2 of 4 stars (very good)</p>
<p><a href=\"http://atlantarestaurants.blog.ajc.com/2015/01/02/the-el-felix-restaurant-review-alpharetta/\">Read more about El Felix from the AJC's John Kessler</a></p>
<p><a href=\"http://atlantarestaurants.blog.ajc.com/category/restaurant-reviews-2/\">More restaurant reviews</a></p>",
          "pubDate": "Sun, 11 Jan 2015 09:20:13 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2766164/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/31/02/14/010215Kessler-6.jpg",
            "-length": "388055",
            "-type": "image/jpeg"
          },
          "category": "restaurant reviews",
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/31/02/14/010215Kessler-6.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "The menu at the El Felix includes parilla mixta fajitas, featuring beef, chicken and pork belly on caramelized onions. (Becky Stein / beckysteinphotography.com)"
          }
        },
        {
          "title": "A little slice of Texas",
          "link": "http://www.myajc.com/news/entertainment/a-little-slice-of-texas/njdgb/",
          "description": "<p>The El Felix, in Alpharetta’s new Avalon complex, is the latest from successful Atlanta restaurateur (and native Texan) Ford Fry.</p><p>Though it’s by far his most casual restaurant, it feels like the most heartfelt. The best cooking here happens inside that Venn diagram subset where chef-crafted integrity and sense of place intersect.</p><p>You can admire the tender bite of a tamale or the spice-speckled rumble of crisp skin along a fat, juicy slice of chicken fajita. You also feel in your heart that the mounds of iceberg lettuce and shreds of yellow cheese flanking an order of finger-blistering puffy tacos provide the right touch.</p><p>What you’re tasting is the native-son affection with which Ford and executive chef Kevin Maxey, also a Texan, created this food. I think they may be a bit too cheffy at times and perhaps a bit beholden to tradition at other times, but they go at this menu with smarts and soul.</p>
<hr />
<p><strong>THE EL FELIX</strong></p><p>1130 Avalon Boulevard, Alpharetta. 678-248-5239, <a href=\"http://theelfelix.com\" target=\"_blank\">theelfelix.com</a>. $$-$$$</p><p>2 of 4 stars [very good]</p>",
          "pubDate": "Sat, 10 Jan 2015 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2749144/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/31/02/14/010215Kessler-6.jpg",
            "-length": "388055",
            "-type": "image/jpeg"
          },
          "category": [
            "FoodDrink",
            "ajc-features",
            "restaurant reviews"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/31/02/14/010215Kessler-6.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "The menu at the El Felix includes parilla mixta fajitas, featuring beef, chicken and pork belly on caramelized onions. (Becky Stein / beckysteinphotography.com)"
          },
          "dc:creator": "John Kessler"
        },
        {
          "title": "There's a new restaurant in downtown Atlanta featuring \"coastal soul\" cuisine",
          "link": "http://www.accessatlanta.com/news/lifestyles/food-cooking/first-look-asante-downtown-atlanta/njgwM/",
          "description": "<p>Originally set to open in early November, celebrity chef Marvin Woods&rsquo; Asante Restaurant and Lounge debuted in early December in the two-story downtown Atlanta space formerly occupied by Peasant Bistro. The concept features &ldquo;coastal soul cuisine,&rdquo; blending dishes from regions around the world with Woods&rsquo; experiences as a TV host, cookbook author and lead chef for first lady Michelle Obama&rsquo;s &ldquo;Let&rsquo;s Move&rdquo; campaign.</p>
<p><strong>The look:</strong> Woods had a hand in the redesign, which is airy and glamorous, with soaring ceilings, mirrors and windows, white glazed brick walls and wrought iron railings. The downstairs lounge features a dangling light sculpture swimming with crystal fish. Upstairs, the mezzanine-like dining room is arranged around intimate nooks.</p>
<p><strong>The scene:</strong> One wintery evening, the streets around Centennial Olympic Park were bustling with tourists, while the scene inside Asante was convivial and cool, with a mix of classic soul and Caribbean music bubbling from the sound system. Woods, General Manager David Espin, and assistant General Manager Ellen Woods were on the scene, greeting guests and checking on tables.</p>
<p><strong>The food:</strong> Woods&rsquo; brightly plated dishes include starters such as cashew cheese and capari tomatoes ($9), creole baked eggplant ($8) and spiced crispy okra ($6). Entrees and specialties range from piri piri Nigerian king prawn ($21) and Puerto Rican pork shoulder ($17) to Creole-braised yellowtail snapper ($23) and pimento-grilled culot steak ($23). Signature dumplings ($9-$21) are served as appetizers or entrees in Southern, Caribbean or gluten-free variations.</p>
<p><strong>The drinks:</strong> At the bar, look for house cocktails, such as the Pisco Con Awin, with pisco, Cointreau, tamarind and agave pepper syrup ($12), and the Asante Sour with Bulleit rye, amaro, honey ginger and merlot drizzle ($13). The wine list ranges from a $9 glass of Viognier to a $279 bottle of Krug Grande Cuv&eacute;e champagne.</p>
<p><strong>The extras:</strong> The weekday lunch menu offers po&rsquo; boy sandwiches with catfish, shrimp, chicken or roast pork ($9-$12). On Sundays, brunch is served from 11 a.m. until 8 p.m.</p>
<hr />
<p>DINING OUT</p>
<p>Dinner: 5:30-10 p.m. Monday-Thursday; 5:30-11 p.m. Friday-Saturday. Lunch: 11 a.m.-3 p.m. Monday-Friday. Brunch: 11 a.m.-8 p.m. Sunday.</p>
<p>Starters and salads, $6-$17; entrees and specialties, $17-$31; sides, $4-$7; desserts, $6-$8.</p>
<p>250 Park Ave. West N.W., Atlanta. 404-893-0022. <a href=\"http://www.asanteatl.com\" target=\"_blank\">asanteatl.com</a>.</p>",
          "pubDate": "Tue, 06 Jan 2015 00:19:40 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2754068/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/06/01/f4/010715firstlook-1.jpg",
            "-length": "244425",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features",
            "Buckhead"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2015/01/06/01/f4/010715firstlook-1.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "Asante’s Cashew Cheese, Capari Tomatoes, Molho de Pimenta Malgueta. (Beckysteinphotography.com)"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: Peach & the Porkchop, Roswell",
          "link": "http://www.ajc.com/news/lifestyles/first-look-peach-the-porkchop-roswell/njcw6/",
          "description": "<p>Peach &amp; the Porkchop seems to have a split personality. The family-friendly destination opened in Roswell&rsquo;s Sweet Apple Village in October, featuring both a sports pub and a fine dining restaurant, with menus divided between &ldquo;Northern-style&rdquo; deli sandwiches and Southern-influenced entrees.</p>
<p><strong>The look:</strong> The pub, which adjoins the open kitchen, is anchored by a semicircular bar situated under a soaring vaulted ceiling, with multiple TVs perched around the walls. The quieter dining room recalls Craftsman style with stacked stone, plank floors and hammered copper fixtures.</p>
<p><strong>The scene:</strong> On a recent Sunday afternoon, the dual nature of Peach &amp; the Porkchop was easily evident. In the pub, owner Chuck Staley, who&rsquo;s from Pittsburgh, hosted beer-drinking Steelers fans dressed in black and gold, as a hometown contingent elbowed up to the bar to root for the Falcons. Meanwhile, in the dining room, several large parties gathered bearing Christmas gift bags.</p>
<p><strong>The food:</strong> Among hefty sandwiches, served with house-made potato chips, find the Garr-O corned beef ($12) with Thousand Island, sauerkraut and Swiss on caraway rye, and the Big Bologna ($12) with Patak German bologna, bacon, caramelized onions, provolone and barbecue sauce on a Kaiser roll. Entrees top out at $34 for a bone-in cowboy rib eye. More reasonably priced offerings include Southern fried chicken ($18) with whipped sweet potatoes, grilled asparagus and gingered apples and pecans, and blackened red grouper ($22) with smoked corn, tomato farro, arugula pesto and lemon mascarpone.</p>
<p><strong>The drinks:</strong> On the beverage menu, look for some 50 craft, domestic and import beers on draft and in the bottle ($4.50-$12.50), as well as sizable wine and spirits lists. Adult milkshakes ($8-$10) include the Sweet Georgia Peach with Georgia Peach Bourbon and High Road Bourbon Burnt Sugar ice cream.</p>
<p><strong>The extras:</strong> For dessert, there&rsquo;s the likes of roasted parsnip cake ($7) with cr&egrave;me anglaise and berries, and pecan pie cheesecake ($8).</p>
<hr />
<p>DINING OUT</p>
<p>11 a.m.-10 p.m. Sunday; 11 a.m.-10 p.m. Tuesday-Staturday. Closed Monday.</p>
<p>Starters, $3-$12; salads, $6-$9; sandwiches and burgers, $8-$14; entrees, $14-$34; sides, $3-$6; desserts, $6-$8.</p>
<p>12040 Etris Road, Roswell. 770-696-5409. <a href=\"http://peachandtheporkchop.com\" target=\"_blank\">peachandtheporkchop.com</a>.</p>",
          "pubDate": "Tue, 30 Dec 2014 11:45:24 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2747475/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/30/7e/fc/123114firstlook-1.jpg",
            "-length": "271056",
            "-type": "image/jpeg"
          },
          "category": [
            "taxon:roswell",
            "roswell",
            "restaurants",
            "new restaurants",
            "lifestyle",
            "capsule review",
            "ajc-print",
            "ajc-features",
            "Sweet Apple Village"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/30/7e/fc/123114firstlook-1.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "Peach and the Pork Chop Southern fried chicken with whipped sweet potatoes, grilled asparagus, gingered apples & pecans. (Beckysteinphotography.com)"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "First Look: The Café at Linton’s, Atlanta Botanical Garden",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-the-cafe-at-lintons-atlanta-botanical-g/njYZy/",
          "description": "<p>Though it sometimes seems he&rsquo;s best known for the crowd-pleasing H&amp;F Burger, James Beard Award-winning chef Linton Hopkins oversees a food and beverage group that includes Restaurant Eugene, Holeman &amp; Finch Public House, H&amp;F Bread Company, and H&amp;F Bottle Shop. Hopkins&rsquo; latest destination, The Caf&eacute; at Linton&rsquo;s, is a renovated space in the Garden House at the Atlanta Botanical Garden, serving lunch, dinner, brunch and snacks.</p>
<p><strong>The look:</strong> Particularly compared to the previous Metrofresh quick-service concept, Linton&rsquo;s offers a graceful dining environment &mdash; from the awning over the front door and pair of topiaries framing the foyer, to classic French bistro-style tables and cushy stripped banquettes.</p>
<p><strong>The scene:</strong> One recent afternoon, the twinkling holiday scenes at the garden proved a festive backdrop for a lunch crowd that included families with small children, tourists and a scattering of employees. Servers in white aprons glided around the dining room, filling water glasses and offering menu suggestions.</p>
<p><strong>The food:</strong> Hopkins and executive sous chef Justin Van Aken have created menus that fit the needs of visitors, while elevating the food beyond what&rsquo;s typically found at similar spots, and using herbs and vegetables grown at the Garden. Starters include Sea Island red peas ($7) with ham hock and cornbread crostini, and a regional charcuterie plate ($15). On the lunch menu, find San Marzano tomato soup ($4/$7) with basil pesto and olive levain, and a pressed Cuban sandwich ($9) with mojo roast pork, shaved ham and Swiss cheese. Lunch and dinner plates include White Oak Pastures chicken pot pie ($17) with H&amp;F puff pastry, and shrimp and soft grits ($18/$24) with she crab cream and trout roe.</p>
<p><strong>The drinks:</strong> On the beverage menu ($2-$5), look for Mountain Valley sparkling water, Arden&rsquo;s Garden juices, Coke products, tea and coffee. Lots of local beers ($6) are featured, with Three Taverns Prince of Pilsen, Wild Heaven Let There Be Light, Terrapin Hi-5 IPA, and Sweetwater Festive Ale on the current list. There&rsquo;s also a surprisingly large wine list, with some three dozen selections by the bottle and glass.</p>
<p><strong>The extras:</strong> Enjoy The Caf&eacute; while you can. In late 2015, it will be replaced by a new full-service restaurant, Linton&rsquo;s in the Garden, housed in a two-story contemporary glass structure.</p>
<hr />
<p>DINING OUT</p>
<p>Lunch: 11 a.m.-4 p.m. Tuesday-Friday. Dinner: 5-10 p.m. Monday-Sunday. Brunch: 11 a.m.-4 p.m. Saturday-Sunday. Snacks: 10 a.m.-3 p.m. Monday-Sunday.</p>
<p>Starters, $7-$15; salads, $9-$12; soups, $4-$7; sandwiches, $8-$9; plates, $14-$24; sweets, $4-$6; snacks, $1-$9.</p>
<p>1345 Piedmont Ave. N.E., Atlanta. 404-585-2061. <a href=\"http://www.lintonsinthegarden.com\" target=\"_blank\">lintonsinthegarden.com</a>.</p>",
          "pubDate": "Tue, 23 Dec 2014 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2740090/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/22/c4/1f/122414Firstlook-2.jpg",
            "-length": "241089",
            "-type": "image/jpeg"
          },
          "category": [
            "taxon:intown atlanta",
            "new restaurants",
            "lifestyle",
            "food",
            "ajc-features",
            "Intown Atlanta"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/22/c4/1f/122414Firstlook-2.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "Potage of shrimp and soft grits, with she crab cream and trout roe at The Café at Linton’s. (Beckysteinphotography.com)"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "Makan restaurant, Decatur: Pan-Asian confusion beats best intentions",
          "link": "http://www.accessatlanta.com/news/entertainment/pan-asian-confusion-beats-best-intentions/njQ2s/",
          "description": "<p>How nice it would be to get a couple of pork belly buns, sit at the comfortable bar at this new Decatur restaurant and get a pint of a good local microbrew.</p>
<p>The buns are great, but the rest of Makan&rsquo;s pan-Asian menu remains troublesome. The kitchen&rsquo;s ambitions, which draw on both Asian street food and Chinese family dinners, outstrip its execution.</p>
<p>Comfort dishes, such as fried rice and ramen, deliver a salt overload. Edgy experiments &mdash; rice cakes and sweetbreads, anyone? &mdash; have blurry flavors. And family-style meals don&rsquo;t communicate a sense of plenty.</p>
<p>It&rsquo;s a shame, because this restaurant uses quality local meats and vegetables and has no shortage of interesting ideas about Asian-American cooking in the 21st century.</p>
<p>You might do well ordering a wok-fried whole fish or roast duck for the table with braised greens and rice.</p>
<p>Enjoy the hip atmosphere and good drinks, and hope Makan finds its groove.</p>
<hr />
<p><strong>MAKAN</strong></p>
<p>130 Clairmont Ave., Decatur. 404-996-6504, <a href=\"http://makanatl.com\" target=\"_blank\">makanatl.com</a>. $$-$$$</p>
<p>0 of 4 stars [fair]</p>",
          "pubDate": "Sat, 20 Dec 2014 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2727772/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/11/35/5d/Pork-belly-Bun-photo-credit-Tuan-Huynh.jpg",
            "-length": "356711",
            "-type": "image/jpeg"
          },
          "category": [
            "review capsule",
            "restaurant reviews",
            "ajc-features",
            "FoodDrink"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/11/35/5d/Pork-belly-Bun-photo-credit-Tuan-Huynh.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Tuan Huynh"
            },
            "media:description": "The pork belly buns are great, but the rest of Makan’s pan-Asian menu remains troublesome. (Tuan Huynh)"
          },
          "dc:creator": "John Kessler"
        },
        {
          "title": "First Look: Paces & Vine, Vinings",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-paces-vine-vinings/njSyj/",
          "description": "<p>More than 30 years after founding the Virginia-Highland classic, Murphy&rsquo;s, Tom Murphy recently opened a new restaurant in Vinings, partnering with executive chef Ian Winslade and director of operations Dave Green. It was the right time, in the right place, with the right team, Murphy says of the concept called Paces &amp; Vine, which dittos Murphy&rsquo;s neighborhood charm, while offering its own style of comfort.</p>
<p><strong>The look:</strong> The new place is situated in the former Garrison&rsquo;s Broiler &amp; Tap space in the Vinings Jubilee shopping and dining district. Murphy hired Smith Hanes Studio to gut and rebuild the interior, which features whitewashed brick arches and a layered wood plank and beam ceiling. Pale blue and gray colors, wood floors and plush banquettes add to the casually elegant atmosphere.</p>
<p><strong>The scene:</strong> At lunch one recent Friday afternoon, Winslade and Green were both present. But it was Murphy who was in demand, chatting and shaking hands with new guests and hugging old friends. Around the dining room, middle-aged couples, worker refugees and ladies who lunch generated a buoyant buzz.</p>
<p><strong>The food:</strong> Winslade&rsquo;s menu reprises some of Murphy&rsquo;s value-priced favorites, such as Guinness braised brisket ($20) and roasted Springer Mountain chicken ($20). There are new apps, like braised octopus with Tuscan white bean vinaigrette and pickled shallots ($13), and a Jonah crab cake ($17) with black pepper emulsion, shaved fennel and baby beet salad. And entrees include red snapper on the plancha ($27) with sweet and spicy carrot sauce, bulgur wheat and cucumber, and a wood-grilled 18-ounce bone-in ribeye ($34) served with b&eacute;arnaise and bordelaise sauces.</p>
<p><strong>The drinks:</strong> The wine list, curated by the team at Murphy&rsquo;s Wine Shop, is the star of the beverage menu, with most selections ($4-$70) available by the half glass, glass or bottle. Current seasonal cocktails include the Atlantan Manhattan ($14) with cherry-infused Four Roses small batch bourbon, Dolin sweet vermouth, brandy and chocolate bitters.</p>
<p><strong>The extras:</strong> On the lunch and brunch menus, look for a one-yolk omelet ($14) with roasted mushrooms, asparagus and cheddar, a lamb burger ($14) with goat cheese and fig jam, and sweet potato ravioli ($12) with smoked popcorn dashi and toasted pumpkin seeds.</p>
<hr />
<p>DINING OUT</p>
<p>11 a.m.-10 p.m. Mondays-Thursdays; 11 a.m.-11 p.m Fridays; 9 a.m.-11 p.m. Saturdays; 9 a.m.-10 p.m. Sundays.</p>
<p>Appetizers, $4-$17; entrees, $14-$34; sandwiches, $10-$15; brunch items, $8-$19.</p>
<p>4300 Paces Ferry Road S.E., Suite 250, Atlanta. www.<a href=\"http://www.pacesandvine.com\" target=\"_blank\">pacesandvine.com</a>.</p>",
          "pubDate": "Tue, 16 Dec 2014 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2732089/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/15/af/8d/121714-first-look_1.jpg",
            "-length": "249040",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "food",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/15/af/8d/121714-first-look_1.jpg",
            "media:description": "Guinness-braised brisket at Paces & Vine. Photo credit: Michael Kunz"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "Bartaco, Intown Atlanta: Skip the signature tacos and enjoy the vibe",
          "link": "http://www.accessatlanta.com/news/entertainment/restaurants/skip-the-signature-tacos-and-enjoy-the-vibe/njKT3/",
          "description": "<p>This newcomer is from the Connecticut-based restaurant group that brought us Inman Park&rsquo;s Barcelona, and it is the fifth iteration of a concept that has served the company well in the Northeast. That may explain the hard-core Yankee vibe. With its white and marine-blue wood paneling, striped booth cushions and easy blurring of space between the bar-dominated inside and outdoor patio, everything about this place says beach party in the Hamptons.</p>
<p>I wouldn&rsquo;t spend too much time with the signature tacos, which come on firm, unlikable corn tortillas. But you can drink and nibble well if you hit the menu&rsquo;s sweet spots. There&rsquo;s nothing wrong and quite a lot right with the house mojito, as well as a seasonal caipirinha goosed with orange and a bare dash of elderflower liqueur. Nosh on a tangy chopped salad and a sloppy but easy-to-love ear of street corn rolled in mayonnaise, cojita cheese and red chile. A half rotisserie chicken is tender and well seasoned, and a steal at $8.</p>
<hr />
<p><strong>BARTACO</strong></p>
<p>969 Marietta St., Atlanta. 404-607-8226, $-$$, <a href=\"http://bartaco.com\" target=\"_blank\">bartaco.com</a>.</p>
<p>1 of 4 stars [good]</p>",
          "pubDate": "Sat, 13 Dec 2014 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2715606/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/02/25/1e/120514kessler-7.jpg",
            "-length": "397990",
            "-type": "image/jpeg"
          },
          "category": [
            "review capsule",
            "restaurant reviews",
            "ajc-features",
            "FoodDrink"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/02/25/1e/120514kessler-7.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "At Bartaco, the chef’s selection of tacos includes two baja fish, two chicken and two pork belly tacos served with tamales, spicy cucumber salad and chipotle slaw. (Becky Stein / beckysteinphotography.com)"
          },
          "dc:creator": "John Kessler"
        },
        {
          "title": "First Look: Cooks & Soldiers, West Midtown",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-cooks-soldiers-west-midtown/njPJz/",
          "description": "<p>Cooks &amp; Soldiers is the newest concept from the Castellucci Hospitality Group, which includes the Iberian Pig in Decatur, Double Zero in Sandy Springs, and Sugo in Johns Creek. The Basque-inspired concept in West Midtown represents another step for the next generation of the Castellucci family, with Federico Castellucci III working the front of the house and John Castellucci serving as executive sous chef.</p>
<p><strong>The look:</strong> Located on the main floor of the new Elan Westside luxury apartment development at the corner of 14th Street and Howell Mill Road, the cool, contemporary space offers views of the surrounding cityscape. The sprawling bar area features a small exhibition kitchen, where chefs create Basque-style tapas, while the dining room looks into the main kitchen and wood-fired grill.</p>
<p><strong>The scene:</strong> One recent evening around dinnertime, there was a wait for a table. The dining room was crowded with Castellucci restaurant regulars, who&rsquo;d made reservations to check out the latest venture. The bar was busy, too, with a chatty younger crowd enjoying drinks and snacks.</p>
<p><strong>The food:</strong> Executive chef Landon Thompson, recently chef de cuisine at the Iberian Pig, oversees a menu divided between snacks, small plates and wood-grilled meat, seafood and vegetables. Among traditional tapas served on toast ($5-$8), boquerones are layered with white anchovy, blood orange marmalade and apple-serrano salad. Small plates include grilled Spanish octopus ($15) with charcoal potatoes, piquillo emulsion and rosemary. Wood-grilled dishes, meant to be shared, range from head-on Madagascar prawns ($22) to a kilo of bone-in rib eye ($74).</p>
<p><strong>The drinks:</strong> On the drinks list, find American and Spanish cider by the glass ($9-$12) and bottle ($25-$44), and Spanish txakoli ($54-$69/bottle), a light wine considered the perfect pairing for tapas. Signature cocktails ($10-$13) include The Seven Are One with gin, lime juice, simple syrup, cherry tomatoes, basil leaves and salt, and Fox Manhattan with rye, benedictine, antica formula, cherry bark and vanilla bitters.</p>
<p><strong>The extras:</strong> For dessert ($6-$8), look for the likes fior di latte gelato, amaro and frozen berries, and Basque cake with house-made cherry preserves, marcona almonds and sparkling cider.</p>
<hr />
<p>DINING OUT</p>
<p>5-10 p.m. Sundays-Wednesdays. 5-11 p.m.Thursdays; 5 p.m.-midnight Fridays-Saturdays. Bar open until 2 a.m. Fridays-Saturdays.</p>
<p>Starters, $5-$8; small plates, $7-$18; wood-grilled meat and seafood, $22-$74; wood-grilled vegetables, $6-$9; desserts, $6-$8.</p>
<p>691 14th Street, Atlanta. 404-996-2623. <a href=\"http://cooksandsoldiers.com\" target=\"_blank\">cooksandsoldiers.com</a>.</p>",
          "pubDate": "Tue, 09 Dec 2014 11:14:20 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2724017/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/09/71/bb/121014-first-look_1.jpg",
            "-length": "168234",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/12/09/71/bb/121014-first-look_1.jpg",
            "media:description": "Boquerones, traditional Basque tapas with white anchovy, blood orange marmalade and apple-serrano salad"
          },
          "dc:creator": "Bob Townsend"
        },
        {
          "title": "Mavericks Cantina, Johns Creek",
          "link": "http://www.accessatlanta.com/news/entertainment/mavericks-cantina-johns-creek/njGd3/",
          "description": "<p>Like many chefs before him, Nicholas St. Clair of Antebellum has chosen to open a crowd-pleasing modern Mexican taqueria for his sophomore effort. But while you can scratch the itch for a taco and margarita, you won&rsquo;t find any of the precision or wit that marks the chef&rsquo;s cooking at his Flowery Branch treasure.</p>
<p>The best expression of what I hoped to get from St. Clair came in the form of a colorful salad of creamy avocado, sweet pineapple, crunchy jicama sticks and a tart charred-lime vinaigrette. Fried chicken tacos came aggressively seasoned and loaded with vinegary Alabama white barbecue sauce and sweet chow chow that spilled from warm tortillas. Finger &mdash; er, arm &mdash; licking good.</p>
<p>I might skip the heavy-handed pork belly torta and think twice about reordering the tough, extra greasy churros with spiced Mexican hot chocolate. But other tacos, such as grouper with pineapple, pickled jalapenos and a delightful lime crema, pair well with the margaritas and friendly conversation.</p>
<hr />
<p><strong>MAVERICKS CANTINA</strong></p>
<p>11030 Medlock Bridge Road, Johns Creek. 470-395-6140, <a href=\"http://maverickscantina.com\" target=\"_blank\">maverickscantina.com</a>. $$</p>
<p>1 of 4 stars [good, but the food is hit and miss]</p>
<p><a href=\"http://atlantarestaurants.blog.ajc.com/2014/11/27/mavericks-cantina-restaurant-review-johns-creek/\">Read an expanded review from the AJC</a></p>",
          "pubDate": "Sat, 06 Dec 2014 00:00:00 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2709308/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/11/26/78/52/101514firstlook-4.jpg",
            "-length": "295095",
            "-type": "image/jpeg"
          },
          "category": [
            "restaurants",
            "restaurant reviews",
            "capsule review",
            "ajc-features",
            "FoodDrink"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/11/26/78/52/101514firstlook-4.jpg",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Becky Stein"
            },
            "media:description": "This meal at Mavericks Cantina in Johns Creek includes a wood fire-grilled steak taco, a fried chicken taco and a wild grouper with lime-marinated mango taco, served with poblano rice and black beans. On the side is a pomegranate classic margarita. (Becky Stein / beckysteinphotography.com)"
          },
          "dc:creator": "John Kessler"
        },
        {
          "title": "First Look: The El Felix, Alpharetta",
          "link": "http://www.accessatlanta.com/news/lifestyles/first-look-the-el-felix-alpharetta/njKC7/",
          "description": "<p>Two chefs with Texas roots, Ford Fry and Kevin Maxey call the El Felix &ldquo;Mex Tex.&rdquo; But the latest addition to Fry&rsquo;s growing Rocket Farm Restaurants group (JCT. Kitchen, No. 246, the Optimist, King + Duke) is notable for anchoring a prominent spot at Avalon, the new luxury mixed-use development in Alpharetta. And the menu ranges from freebie housemade chips with red and green salsa to market priced wood-grilled Maine lobster.</p>
<p><strong>The look:</strong> Rocket Farm designer Elizabeth Ingram mixes funky and industrial elements with rustic and natural materials. Reclaimed wood meets split-face concrete block, and a length of chain link fence is suspended between the dining room and the sizable bar area, where there&rsquo;s room for drinking, eating and socializing.</p>
<p><strong>The scene:</strong> One recent afternoon, the pre-Thanksgiving rush packed the streets, parking lots and sidewalks around Avalon, creating a giddy holiday atmosphere of shoppers and gawkers. Inside the El Felix, the lunch crowd was serious about sustenance, occupying every seat at the bar and a good portion of the restaurant.</p>
<p><strong>The food:</strong> Fry and Maxey spin Southwestern cooking by looking to the past and adding bits of now. Among the starters, homesick Texans will dig the Bob Armstrong dip ($12) with layers of taco meat, chile con queso, guacamole and sour cream. Campechana de Marisco ($19) is a tall order of Gulf shrimp, octopus, lump crab and avocado, arranged in a parfait glass with spicy cocktail sauce. Dinner plates with rice and beans ($12-$18) feature San Antonio-style &ldquo;puffy tacos,&rdquo; plus hard and soft tacos, enchiladas and chilis rellenos. Wood-grilled plates ($16-$38) range from a slow-braised short rib grilled with chipotle molasses to Gulf shrimp and red snapper.</p>
<p><strong>The drinks:</strong> While there&rsquo;s a decent wine list for a Mexican joint, and a selection of local craft and Mexican beer on draft and in the bottle, the focus of the bar is fun and booze. The house margarita ($7) is a simple mix of reposado tequlia, triple sec and lime, while the Mezcal Smash ($12) riffs on a pre-prohibition classic with the current &ldquo;it&rdquo; spirit, fresh mint, muddled citrus, agave nectar and crushed ice.</p>
<p><strong>The extras:</strong> The $9.99 lunch combo offers a choice of two items from a list that includes nachos, tacos, enchiladas, soups and a house salad.</p>
<hr />
<p>DINING OUT</p>
<p>Hours: 11 a.m.-2:30 p.m. Mondays-Fridays; 5-10 p.m. Mondays-Thursdays; 5 -11 p.m. Fridays; 11 a.m. -11 p.m. Saturdays; 11 a.m.-10 p.m. Sundays.</p>
<p>Starters, $9-$14; soups and salads, $6-$19; plates with rice and beans, $12-$18; wood-grilled plates, $16-$38; lunch plates, $9.99; desserts, $6.</p>
<p>1130 Avalon Blvd., Alpharetta. 678-248-5239. <a href=\"http://theelfelix.com\" target=\"_blank\">theelfelix.com</a>.</p>",
          "pubDate": "Tue, 02 Dec 2014 11:12:44 -0500",
          "guid": "https://identifiers.cmgdigital.com/medley1/news.medleystory/2714952/",
          "enclosure": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/10/24/fc/44/102614_avalon_trend_jp35.JPG",
            "-length": "1716478",
            "-type": "image/jpeg"
          },
          "category": [
            "new restaurants",
            "lifestyle",
            "ajc-print",
            "ajc-features"
          ],
          "media:content": {
            "-url": "http://media.cmgdigital.com/shared/img/photos/2014/10/24/fc/44/102614_avalon_trend_jp35.JPG",
            "media:credit": {
              "-scheme": "photographer",
              "#text": "Jonathan Phillips"
            },
            "media:description": "Chef Kevin Maxey (left) explains the menu to new employees at The El Felix."
          },
          "dc:creator": "Bob Townsend"
        }
      ]
    }
  }
}